[
    {
    "toyId": 1,
    "toyName": "Lego Classic Bricks",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "availableQuantity": 75,
    "description": "The Lego Classic Bricks set is a perfect starting point for endless creativity. Packed with vibrant, high-quality Lego pieces, it allows children to explore the fundamentals of design, construction, and problem-solving through play. From colorful houses and imaginative vehicles to abstract creations, the possibilities are limitless. Every brick connects with precision, ensuring a frustration-free building experience for little hands. Parents love how it encourages patience, concentration, and spatial awareness. Suitable for both beginners and experienced builders, this set promises hours of open-ended fun and creative expression. A must-have toy for every growing mind who loves to build and invent.",
    "pictureURL": "https://i.postimg.cc/FKV1sK1R/Lego-Classic-Bricks.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 2,
    "toyName": "Doll Set",
    "sellerName": "Happy Toys Corner",
    "sellerEmail": "sales@happytoys.com",
    "price": 89.99,
    "rating": 4.6,
    "availableQuantity": 40,
    "description": "This beautifully crafted Doll Set brings imagination to life with stunning detail and quality. Each doll is designed with realistic facial features, soft hair for styling, and flexible joints for lifelike posing. The set includes multiple outfits, accessories, and miniature furniture, encouraging storytelling and social play. Children can act out everyday scenarios or invent new adventures with their dolls, boosting creativity and emotional development. Made from safe, non-toxic materials, every piece is durable and child-friendly. Whether it’s a tea party, a fashion show, or a rescue mission, this set transforms playtime into a world of wonder. A perfect gift for young dreamers and collectors alike.",
    "pictureURL": "https://i.postimg.cc/HxWnJC7V/Doll-Set.jpg",
    "subCategory": "Dolls & Figures"
  },
  {
    "toyId": 3,
    "toyName": "Remote Control Monster Truck",
    "sellerName": "ZoomKids Toy Hub",
    "sellerEmail": "zoomkids@toysmail.com",
    "price": 59.99,
    "rating": 4.8,
    "availableQuantity": 60,
    "description": "The Remote Control Monster Truck is built for adrenaline and excitement, combining speed, durability, and precision control. It’s equipped with a powerful motor, all-terrain suspension, and large rubber tires that conquer rough surfaces with ease. Kids can perform flips, jumps, and sharp turns without losing balance, thanks to its shock-resistant frame. The easy-to-grip remote allows seamless navigation, offering full control for thrilling races indoors or outdoors. Designed to withstand bumps and collisions, it ensures long-lasting fun for every adventure seeker. Whether racing across grass, gravel, or pavement, this truck delivers unstoppable energy and non-stop entertainment. The perfect gift for young racing enthusiasts who crave action and performance.",
    "pictureURL": "https://i.postimg.cc/yNyWYNWH/Remote-Control-Monster-Truck.jpg",
    "subCategory": "Vehicles & RC Toys"
  },
  {
    "toyId": 4,
    "toyName": "Wooden Train Set",
    "sellerName": "Classic Toy Makers",
    "sellerEmail": "info@classictoys.com",
    "price": 34.99,
    "rating": 4.5,
    "availableQuantity": 90,
    "description": "Bring timeless play into your child’s world with this beautifully handcrafted Wooden Train Set. Made from smooth, eco-friendly wood, it features a network of tracks, colorful engines, carriages, bridges, and scenic trees. Each piece fits together perfectly, encouraging kids to plan and construct their own railway systems. The tactile experience of connecting and moving the trains enhances fine motor skills and logical thinking. With its classic design, this toy not only inspires creativity but also introduces children to cause-and-effect concepts through play. Safe, sturdy, and sustainable — it’s a nostalgic favorite that sparks imagination for generations. Ideal for both independent and group play.",
    "pictureURL": "https://i.postimg.cc/HL9jsLnf/Wooden-Train-Set.jpg",
    "subCategory": "Educational Toys"
  },
  {
    "toyId": 5,
    "toyName": "Stuffed Teddy Bear",
    "sellerName": "Cuddle World",
    "sellerEmail": "support@cuddleworld.com",
    "price": 24.99,
    "rating": 4.9,
    "availableQuantity": 150,
    "description": "The Stuffed Teddy Bear is the perfect blend of comfort, softness, and charm. Made from premium-quality plush fabric and filled with fluffy, hypoallergenic stuffing, this teddy bear feels incredibly cozy to hug. Its gentle smile and warm expression make it an instant companion for kids of all ages. Whether used as a bedtime buddy, a comforting presence during travel, or a decorative piece in a child’s room, it radiates warmth and affection. Built with child-safe stitching and durable materials, it’s made to last through countless cuddles. This teddy isn’t just a toy — it’s a friend that listens, comforts, and stays by your side forever.",
    "pictureURL": "https://i.postimg.cc/cJSrS310/Stuffed-Teddy-Bear.jpg",
    "subCategory": "Stuffed Toys"
  },
  {
    "toyId": 6,
    "toyName": "Kids Doctor Play Set",
    "sellerName": "Little Heroes Shop",
    "sellerEmail": "contact@littleheroes.com",
    "price": 39.99,
    "rating": 4.4,
    "availableQuantity": 55,
    "description": "The Kids Doctor Play Set transforms playtime into a fun learning experience. Packed with realistic medical tools like a stethoscope, thermometer, syringe, and otoscope, it lets children explore the fascinating world of healthcare. Each instrument is crafted from non-toxic, durable plastic that’s safe for small hands. By pretending to care for their toys or friends, children develop empathy, communication skills, and confidence. It’s a fantastic way to encourage curiosity about science and medicine while promoting role-play and imagination. Parents love how it blends entertainment with education, helping kids overcome the fear of doctor visits. A complete set for every aspiring little doctor who loves to help others.",
    "pictureURL": "https://i.postimg.cc/QMJVxMCv/Kids-Doctor-Play-Set.webp",
    "subCategory": "Role Play Sets"
  },
  {
    "toyId": 7,
    "toyName": "Fisher-Price Rock-a-Stack",
    "sellerName": "Baby Boutique",
    "sellerEmail": "service@babyboutique.com",
    "price": 8.99,
    "rating": 4.8,
    "availableQuantity": 150,
    "description": "The Fisher-Price Rock-a-Stack toy is classic, colorful fun for your little one! This timeless toy features a wobbly rocker base and 5 colorful rings for little hands to grasp and stack. Stacking helps baby develop hand-eye coordination and introduces them to the concept of relative size as they learn to sort and stack from biggest to smallest. Younger babies will love grasping, holding, shaking, and exploring the five colorful rings. The top ring has a shiny, reflective surface for baby to discover inside—with colorful, swirling beads that make fun rattle sounds to stimulate auditory senses! The bat-at rocker base wobbles back and forth, encouraging the baby to sit up and reach, strengthening their core muscles. Made from durable, baby-safe materials, this toy is easy to clean and designed to withstand the rigors of toddler play. It is an essential developmental toy for infants aged 6 months and older.",
    "pictureURL": "https://i.postimg.cc/QrT6v4/Fisher-Price-Stack.jpg",
    "subCategory": "Baby & Toddler"
  },
  {
    "toyId": 8,
    "toyName": "Magna-Tiles 32-Piece Clear Colors Set",
    "sellerName": "EduPlay Store",
    "sellerEmail": "contact@eduplaystore.com",
    "price": 49.99,
    "rating": 4.9,
    "availableQuantity": 60,
    "description": "Magna-Tiles are the original 3D magnetic building tiles by Valtech, sparking creativity since 1997. This 32-piece set features translucent, colorful shapes including squares (large and small) and triangles (equilateral, right, and isosceles). Each tile edge is magnetized with strong ceramic magnets, allowing kids to connect them to build anything they can imagine, from flat 2D mosaics to towering 3D castles, rockets, and animals. The tiles are made from food-grade ABS plastic that is free of BPA, phthalates, and latex, ensuring safety and durability. The sonic-welded construction prevents the tiles from breaking, keeping the magnets safely enclosed. Not only are Magna-Tiles incredibly fun, but they also help develop critical STEM skills such as spatial awareness, math, logic, and problem-solving. Compatible with all other Magna-Tiles sets, this 32-piece pack is the perfect starter set or expansion to an existing collection.",
    "pictureURL": "https://i.postimg.cc/WtY5u7/Magna-Tiles-32.jpg",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 9,
    "toyName": "Uno Card Game",
    "sellerName": "Card Shark",
    "sellerEmail": "sales@cardshark.com",
    "price": 5.99,
    "rating": 4.9,
    "availableQuantity": 500,
    "description": "UNO is the classic card game that’s easy to pick up and impossible to put down! Players take turns matching a card in their hand with the current card shown on top of the deck either by color or number. The deck includes 112 cards featuring four color suits (Red, Green, Blue, and Yellow), along with 8 Wild cards and 8 Draw Four Wild cards that add excitement and unpredictability. Special action cards deliver game-changing moments as they help you defeat your opponents; these include Skips, Reverses, and Draw Twos. It’s a fast-paced game where strategy meets luck. Don’t forget to shout 'UNO' when you only have one card remaining! The first player to rid themselves of all the cards in their hand before their opponents wins. Perfect for 2 to 10 players, this game is a staple for family gatherings, travel, and parties. The set comes in a sturdy cardboard box for easy storage and includes instructions in multiple languages.",
    "pictureURL": "https://images.unsplash.com/photo-1605312015024-644787d55c7a?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Card Games"
  },
  {
    "toyId": 10,
    "toyName": "Melissa & Doug Wooden Pizza Counter",
    "sellerName": "Wooden Wonders",
    "sellerEmail": "hello@woodenwonders.com",
    "price": 54.99,
    "rating": 4.8,
    "availableQuantity": 45,
    "description": "Mama mia, it's pizza time! Create fresh-baked pizza, made to order, with this delicious 34-piece wooden pizza-making set. This comprehensive pretend play set allows kids to be the chef. Start with felt sauce and cheese on the wooden crust, choose from wooden toppings (pepperoni, olives, mushrooms, and peppers), then 'bake' in the pizza oven built into the storage and serving counter. Pieces stick together with self-stick tabs that make a satisfying slicing sound when cut with the rolling wooden cutter. The set includes a grated cheese shaker, a wooden paddle, a pizza box, a reusable menu, and play money to pay for the order. It encourages fine motor skills, sorting, counting, and imaginative play. The sturdy wooden construction ensures this toy will last through years of enthusiastic cooking. It makes an exceptional gift for kids ages 3 to 6 who love role-playing and food-themed activities.",
    "pictureURL": "https://images.unsplash.com/photo-1571217696313-b82b9dc3905d?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Pretend Play"
  },
  {
    "toyId": 11,
    "toyName": "VTech KidiZoom Camera Pix",
    "sellerName": "Tech Tots",
    "sellerEmail": "support@techtots.com",
    "price": 39.99,
    "rating": 4.5,
    "availableQuantity": 90,
    "description": "Take real digital photographs with the durable KidiZoom Camera Pix by VTech. Designed specifically for little hands, this kid-friendly camera includes all the tools budding photographers need to use their creativity. It features a 2.0-megapixel lens with 4x digital zoom to capture photos of things far away. Kids can turn the lens to take photos of themselves and their friends in selfie mode, with automatic face detection to ensure the perfect shot. The camera comes loaded with fun photo effects, stamps, and frames to edit photos directly on the device. Beyond photography, it includes a video recorder and voice recorder for 5 distinct ways to play. When not snapping pics, kids can enjoy 4 built-in games that add to the fun. The durable design protects against drops and tumbles. It requires 4 AA batteries (included for demo purposes) and supports a microSD card (sold separately) for expandable memory storage. Ideal for ages 3 to 8.",
    "pictureURL": "https://images.unsplash.com/photo-1516035069371-29a1b244cc32?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Electronics"
  },
  {
    "toyId": 12,
    "toyName": "Squishmallows 14-Inch Plush",
    "sellerName": "Cuddle Corner",
    "sellerEmail": "hug@cuddlecorner.com",
    "price": 19.99,
    "rating": 5.0,
    "availableQuantity": 110,
    "description": "Squish time is playtime when you add this plush to your Squishmallows Squad. This ultra-squeezable, 14-inch, large plush is made with high-quality and ultrasoft materials, often described as having a marshmallow-like texture. This specific plush features unique embroidery and personality details that make it a collectible favorite. Whether it's a cat, dinosaur, unicorn, or food item, every Squishmallow has its own name and bio tag to spark imagination. This soft plush is perfect to snuggle with while relaxing at home, watching a movie, or taking a long car or plane ride. It also doubles as a fantastic pillow for naps or bedtime. Machine washable and easy to clean, Squishmallows retain their shape and softness over time. They are suitable for all ages, from babies to adults who need a comforting companion. Join the squad and collect them all!",
    "pictureURL": "https://images.unsplash.com/photo-1533228876829-65c94e7b5025?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Plush Toys"
  },
  {
    "toyId": 13,
    "toyName": "Transformers Generations Optimus Prime",
    "sellerName": "Robot Realm",
    "sellerEmail": "sales@robotrealm.com",
    "price": 33.99,
    "rating": 4.7,
    "availableQuantity": 55,
    "description": "Experience the legendary leader of the Autobots with this Transformers Generations figure. Standing approximately 7 inches tall, this Optimus Prime figure is inspired by the classic G1 animation design but updated with modern articulation and detailing. Optimus Prime converts from robot to Earth truck mode in 27 distinct steps, offering a satisfying transformation challenge for kids and collectors alike. The figure features intricate molded details, including his iconic chest windows and smokestacks. It comes equipped with his signature Ion Blaster accessory and the Matrix of Leadership, which fits inside his chest cavity. The figure has multiple points of articulation, including ankles, knees, hips, waist, shoulders, and head, allowing for dynamic battle poses. Whether protecting the universe from the Decepticons or standing proud on a display shelf, this figure captures the heroism of the character perfectly. Includes figure, 2 accessories, and instructions.",
    "pictureURL": "https://images.unsplash.com/photo-1608889175123-8ee362201f81?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 14,
    "toyName": "Crayola Inspiration Art Case",
    "sellerName": "Artistic Avenue",
    "sellerEmail": "create@artisticavenue.com",
    "price": 25.99,
    "rating": 4.8,
    "availableQuantity": 130,
    "description": "Keep art supplies organized and protected with the Crayola Inspiration Art Case. This premier art set acts as a portable art studio, including 140 pieces to fuel imagination. Inside the durable, handled case, you will find 64 Crayola Crayons, 20 Short Colored Pencils, 40 Washable Markers, and 15 sheets of large drawing paper. The case features specific snap-fit compartments for each tool, ensuring that supplies stay neat and organized, making cleanup a breeze. The vast array of colors allows children to explore shading, texture, and color mixing. The markers are formulated to wash easily from skin and most clothing, making this a parent-approved choice. It is the perfect gift for birthdays and holidays for creative kids who love to draw, color, and craft. The sturdy case design allows artists to take their tools wherever they go, from the kitchen table to grandma's house or on vacation.",
    "pictureURL": "https://images.unsplash.com/photo-1513364776144-60967b0f800f?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 15,
    "toyName": "Radio Flyer Classic Red Wagon",
    "sellerName": "Outdoor Adventures",
    "sellerEmail": "fun@outdooradventures.com",
    "price": 99.99,
    "rating": 4.9,
    "availableQuantity": 25,
    "description": "The Radio Flyer Classic Red Wagon is an icon of American childhood, symbolizing outdoor adventure for over 100 years. This full-sized steel wagon features a seamless steel body with no-scratch edges, ensuring safety for little fingers. It is equipped with a working handle with a safe-t-tip design that prevents the wagon from tipping over when turned sharply. The durable molded wheels provide a quiet and smooth ride on pavement or grass. It's perfect for hauling toys, gardening tools, or even kids (weight capacity of 150 lbs). The extra-long handle folds under the wagon for easy storage in garages or car trunks. The controlled turning radius prevents tipping, giving parents peace of mind. Whether used for a trip to the park, a parade float base, or helping with yard work, this wagon is built to last for generations. Assembly is required.",
    "pictureURL": "https://images.unsplash.com/photo-1530268578403-ade52899732a?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Outdoor Play"
  },
  {
    "toyId": 16,
    "toyName": "Jenga Classic Game",
    "sellerName": "Game Night Global",
    "sellerEmail": "play@gamenightglobal.com",
    "price": 15.99,
    "rating": 4.7,
    "availableQuantity": 180,
    "description": "Want a game experience that combines friends, skill, suspense, laughter, and maybe a little luck? You gotta get the Classic Jenga game! It’s the simple yet nerve-wracking game that you can play anytime, anywhere – and any way you like. The set includes 54 precision-crafted hardwood blocks. To play, stack the wooden blocks in a sturdy tower using the loading sleeve, then take turns pulling out blocks one by one and placing them on top. The tower grows higher and more unstable with every turn. Is your hand steady enough to pull out the last block before the tower crashes? It's great for parties, family game nights, and ice-breakers. The rules are simple enough for kids, but the challenge is engaging enough for adults. You can play solo to practice your stacking skills or with a large group. The game comes in a tube-shaped box for easy storage and transport.",
    "pictureURL": "https://images.unsplash.com/photo-1632501641765-e568d28b0015?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Board Games"
  },
  {
    "toyId": 17,
    "toyName": "Tamagotchi Original",
    "sellerName": "Retro Toys",
    "sellerEmail": "support@retrotoys.com",
    "price": 19.99,
    "rating": 4.4,
    "availableQuantity": 95,
    "description": "The Original digital pet you loved in 1997 is back with the original programming! This Gen 1 Tamagotchi allows a new generation to experience the responsibility and fun of raising a virtual pet. You feed it, turn lights on/off, play with it, give it medicine, flush after it’s used the bathroom, check its health, and discipline your Tamagotchi if it bothers you when it’s happy, fed, and all cleaned up. Includes a character game where you have to guess which way the Tamagotchi will move next. How you take care of your Tamagotchi determines which of the 7 Adult characters you’ll get. The device comes on a chain so you can take it with you everywhere. It features the classic egg shape and pixelated LCD screen. Battery (CR2032) is included so you can start playing right away. It's a nostalgic trip for adults and a lesson in caretaking for kids.",
    "pictureURL": "https://images.unsplash.com/photo-1558244402-286dd748c593?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Electronic Pets"
  },
  {
    "toyId": 18,
    "toyName": "Beyblade Burst Surge Speedstorm Arena",
    "sellerName": "Battle Tops Ltd",
    "sellerEmail": "spin@battletops.com",
    "price": 44.99,
    "rating": 4.6,
    "availableQuantity": 40,
    "description": "Supercharge the battle strategy with Beyblade Burst Speedstorm tech! This official Beyblade Burst Speedstorm Motor Strike Battle Set includes everything needed for an epic tournament: the Speedstorm Beystadium, 2 right/left-spin launchers, and 2 spinning tops. The stadium is designed to harness the power of the inescapable Power Vortex -- a motorized spinning disc at the center of the Speedstorm Beystadium designed to pull tops in and give them the ultimate speed boost. Tops can clash in the center for high-intensity collisions. The included tops feature specialized performance tips designed to work with the vortex. Kids can scan the code on the Beyblade Burst tops’ Energy Layers and the Speedstorm Beystadium to unleash them in the Beyblade Burst app. This set is the ultimate gift for fans of the anime series who want to recreate the action in real life. Requires 3 AA batteries for the motorized stadium features.",
    "pictureURL": "https://images.unsplash.com/photo-1614294149010-950b698f72c0?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Action Figures"
  },
  {
    "toyId": 19,
    "toyName": "PAW Patrol Patrol Cruiser",
    "sellerName": "Toon Toys",
    "sellerEmail": "help@toontoys.com",
    "price": 14.99,
    "rating": 4.8,
    "availableQuantity": 160,
    "description": "The PAW Patrol are on a roll in their rescue vehicles! Join Chase on action-packed missions with his Patrol Cruiser! When trouble strikes, place Chase (figure included) into the driver’s seat and roll to the rescue with real working wheels. The cruiser features authentic detailing and realistic features, just like in the hit TV show. There are no batteries required; the action is powered by push-play, allowing for quiet and imaginative fun. The Chase figure is articulated, so he can pose inside or outside the vehicle. This toy is a great way to encourage empathy and bravery through role-play as kids re-enact their favorite rescue missions or create new adventures for the pups. It is compatible with other PAW Patrol figures and playsets (sold separately), allowing kids to build out the whole team including Marshall, Skye, and Rubble. Designed for children aged 3 and up.",
    "pictureURL": "https://images.unsplash.com/photo-1594787318286-3d835c1d207f?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 20,
    "toyName": "Rubik's Cube 3x3",
    "sellerName": "Puzzle Master",
    "sellerEmail": "solve@puzzlemaster.com",
    "price": 9.99,
    "rating": 4.7,
    "availableQuantity": 300,
    "description": "The Rubik’s Cube is the classic color-matching puzzle that can be enjoyed at home or on the move. The original, classic 3x3 cube is a highly addictive brain teaser that has fascinated fans all around the world for decades. The Rubik’s Cube features six different sides, each made up of nine squares. A must for puzzle lovers, the aim is to twist and turn the Rubik’s Cube to its original state, with every side having one solid color. There are over 43 quintillion possible moves, but only one solution! This updated version features a mechanism that results in smoother, faster, and more reliable play, eliminating the frustrating snagging or popping cores of older models. The traditional stickers have been replaced with plastic tiles, meaning no fading, peeling, or cheating! Solving the cube improves muscle memory, hand-eye coordination, and problem-solving skills. Whether you are a beginner or a competitive speedcuber, this puzzle provides hours of challenging fun.",
    "pictureURL": "https://images.unsplash.com/photo-1591991731833-b4807cf7ef94?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Puzzles"
  },
  {
    "toyId": 21,
    "toyName": "Little Tikes Cozy Coupe",
    "sellerName": "Toddler Town",
    "sellerEmail": "drive@toddlertown.com",
    "price": 59.99,
    "rating": 4.8,
    "availableQuantity": 35,
    "description": "For generations, children have been taking adventure and imagination on the road with one of the original ride-on toys—the Cozy Coupe. This updated version of the classic red and yellow car features a removable floor board. When the floor is in, little ones’ feet are protected, and parents can use the convenient handle on the roof to push the car. When the child grows, remove the floorboard to convert it to foot-to-floor power, allowing kids to scoot themselves around. The car features a high seat back and cup holders in the rear. Special features include an ignition switch that clicks, a gas cap that opens and closes, and rugged, durable tires that spin 360 degrees on the front wheels for easy steering. The friendly face on the front brings the car to life. It is designed for indoor or outdoor use and is resistant to weather fading. This ride-on toy aids in the development of gross motor skills and balance. Max weight 50 lbs.",
    "pictureURL": "https://images.unsplash.com/photo-1599623560574-39d485900c95?q=80&w=1000&auto=format&fit=crop",
    "subCategory": "Ride-On Toys"
  }
]